#### ViewDisplayModel Members

---

|  |
| --- |
| ViewDisplayModel Class   Methods   Properties   See Also |

The  ViewDisplayModel  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ViewDisplayModel |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | EnableSilhouettes | True to show silhouettes edges. False to disable showing them. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | ShowHiddenLines | True to enable hidden lines. False to disable showing them. |
| Public property | SilhouetteEdgesGStyleId | Style ID for silhouette edges |
| Public property | SmoothEdges | True to enable "smooth edge" (anti-aliasing) effect. False to disable it. |
| Public property | Transparency | The percentage (0..100) of surface transparency 0 means the surfaces are opaque, 100 means they are fully transparent |

# See Also

ViewDisplayModel Class

Autodesk.Revit.DB Namespace